# 20220128
# 백준 14916 거스름돈
# https://www.acmicpc.net/problem/14916

# 춘향이는 편의점 카운터에서 일한다.
# 손님이 2원짜리와 5원짜리로만 거스름돈을 달라고 한다.
# 2원짜리 동전과 5원짜리 동전은 무한정 많이 가지고 있다.
# 동전의 개수가 최소가 되도록 거슬러 주어야 한다.
# 거스름돈이 n인 경우, 최소 동전의 개수가 몇 개인지 알려주는 프로그램을 작성하시오.

# 예를 들어, 거스름돈이 15원이면 5원짜리 3개를,
# 거스름돈이 14원이면 5원짜리 2개와 2원짜리 2개로 총 4개를,
# 거스름돈이 13원이면 5원짜리 1개와 2원짜리 4개로 총 5개를 주어야 동전의 개수가 최소가 된다.

# 입력 첫째 줄에 거스름돈 액수 n(1 ≤ n ≤ 100,000)이 주어진다.
# 출력 거스름돈 동전의 최소 개수를 출력한다. 만약 거슬러 줄 수 없으면 -1을 출력한다.


money = int(input())

if (money < 5) and (money%2 == 1) : print('-1')
else:
    if (money%5)%2 == 0:
        result = money%5
        a = money//5
        b = result//2
        print(a+b)
    else :
        result = money%5
        a = money//5
        b = (result+5)//2
        print(a-1+b)

# 소스가 너무 더럽다